local disable_take_off_list_tb = {
    ["骑士符"] = 1,
    ["恶魔符"] = 1,
    ["虎威符"] = 1,
    ["雄狮符"] = 1,
    ["睚眦符"] = 1,
    ["麒麟符"] = 1,
    ["苍龙符"] = 1,
    ["狱火符"] = 1,
    ["圣光符"] = 1,
    ["万年·不灭"] = 1,
    ["破灭·之咒"] = 1,
    ["赤焰の符篆"] = 1,
    ["符★文"] = 1,
    ["一转去骨·元神"] = 1,
    ["二转脱胎·元神"] = 1,
    ["三转固本·元神"] = 1,
    ["四转培元·元神"] = 1,
    ["五转明心·元神"] = 1,
    ["六转大悟·元神"] = 1,
    ["七转飞升·元神"] = 1,
    ["八转化神·元神"] = 1,
    ["九转天尊·元神"] = 1,
}

return disable_take_off_list_tb


