local GMTest_tb  = {
    {"解绑特权"},
    {"首充礼包"},
    {"元宝10亿"},
    {"灵符10亿"},
    {"清空背包"},
    {"满材料",
     item = {
         {"转生证明",9999},
         {"转生印记",9999},
         {"转生魔晶",9999},
         {"转生神魂",9999},
         {"称号卷轴",9999},
         {"天道石",9999},
         {"混沌天道石",9999},
         {"上古五行碎片",9999},
         {"传承之晶",9999},
         {"专属神石",9999},
         {"乾坤圣石",9999},
         {"神魔结晶",9999},
         {"混沌结晶",9999},
        }
    },
    {"10+98充值"},
    {"1212+98充值"},
    {"5186+98充值"},
    {"开启GM"},
    {"测试工具（点击无效）"},
    {"补充值",
        huobi = {{id=23,100},{id=24,100},{id=27,1},{id=28,1}},
        id = 23
    },
}

return GMTest_tb