local config = {
    [1] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 1,
        },
        skillID = 3,
        attr = {
            [1] = {
                [1] = 236,
                [2] = 300,
            },
        },
        desc = "攻击力+3%",
    },
    [2] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "攻击力+5%，攻速+1",
    },
    [3] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "每5次攻击额外造成一次等值攻击力的重击伤害",
    },
    [4] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 700,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "攻击力+7%",
    },
    [5] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 700,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "首次攻击怪物，斩杀怪物10%血量",
    },
    [6] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "攻击力+10%，攻速+2",
    },
    [7] = {
        skill = "基本剑术",
        type = {
            [1] = 1,
            [2] = 1,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "怪物血量低于10%时，10%概率直接击杀怪物",
    },
    [8] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 1,
        },
        skillID = 7,
        attr = {
            [1] = {
                [1] = 238,
                [2] = 500,
            },
        },
        desc = "攻杀剑术伤害+5%",
    },
    [9] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "攻杀剑术伤害+10%，攻速+1",
    },
    [10] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "施放攻杀剑术时，10%几率额外附加攻击等值的伤害",
    },
    [11] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "攻杀剑术伤害+15%",
    },
    [12] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "攻杀剑术命中目标后有20%的概率使目标双防下降33%持续2秒",
    },
    [13] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "攻杀剑术伤害+20%，攻速+2",
    },
    [14] = {
        skill = "攻杀剑术",
        type = {
            [1] = 1,
            [2] = 2,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 238,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "施放攻杀剑术时，10%几率对对方造成麻痹效果",
    },
    [15] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 1,
        },
        skillID = 12,
        attr = {
            [1] = {
                [1] = 245,
                [2] = 500,
            },
        },
        desc = "刺杀剑术伤害+5%",
    },
    [16] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "刺杀剑术伤害+10%，攻速+1",
    },
    [17] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "隔位打击目标时对其伤害提高",
    },
    [18] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "刺杀剑术伤害+15%",
    },
    [19] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "刺杀剑术对开启魔法盾的敌人伤害提升25%",
    },
    [20] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "刺杀剑术伤害+20%，攻速+2",
    },
    [21] = {
        skill = "刺杀剑术",
        type = {
            [1] = 1,
            [2] = 3,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 245,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "刺杀剑术从侧面攻击目标时伤害提升20%，如果从背后攻击目标则效果翻倍",
    },
    [22] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 1,
        },
        skillID = 25,
        attr = {
            [1] = {
                [1] = 246,
                [2] = 500,
            },
        },
        desc = "半月伤害+5%",
    },
    [23] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "半月伤害+10%，攻速+1",
    },
    [24] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "半月攻击敌人时增加10点真实伤害",
    },
    [25] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "半月伤害+15%",
    },
    [26] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "释放半月时，20%概率额外触发一次半月",
    },
    [27] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "半月伤害+15%，攻速+2",
    },
    [28] = {
        skill = "半月弯刀",
        type = {
            [1] = 1,
            [2] = 4,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 246,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "领悟圆月之力，半月范围增加，攻击周身范围内的所有目标",
    },
    [29] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 1,
        },
        skillID = 27,
        desc = "野蛮冲撞冷却时间-1秒",
    },
    [30] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 2000,
            },
        },
        desc = "野蛮冲撞伤害+20%",
    },
    [31] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 2000,
            },
        },
        desc = "野蛮可推动“同等级”的玩家",
    },
    [32] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 2000,
            },
        },
        desc = "野蛮冲撞冷却时间-2秒",
    },
    [33] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 2000,
            },
        },
        desc = "野蛮冲撞目标后10%几率立刻凝聚烈火剑法",
    },
    [34] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 3000,
            },
        },
        desc = "野蛮冲撞伤害+30%",
    },
    [35] = {
        skill = "野蛮冲撞",
        type = {
            [1] = 1,
            [2] = 5,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 257,
                [2] = 3000,
            },
        },
        desc = "野蛮冲撞目标后20%概率眩晕敌人2秒",
    },
    [36] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 1,
        },
        skillID = 1033,
        attr = {
            [1] = {
                [1] = 204,
                [2] = 3,
            },
        },
        desc = "提升角色3%伤害减免",
    },
    [37] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 5,
            },
        },
        desc = "提升角色5%伤害减免",
    },
    [38] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 5,
            },
            [2] = {
                [1] = 235,
                [2] = 10,
            },
        },
        desc = "真气入体，生命值得到大幅提升，生命上限增加10%",
    },
    [39] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 7,
            },
            [2] = {
                [1] = 235,
                [2] = 10,
            },
        },
        desc = "提升角色7%伤害减免",
    },
    [40] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 7,
            },
            [2] = {
                [1] = 235,
                [2] = 10,
            },
        },
        desc = "每遭受7次攻击，抵挡一次伤害",
    },
    [41] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 10,
            },
            [2] = {
                [1] = 235,
                [2] = 10,
            },
        },
        desc = "提升角色10%伤害减免",
    },
    [42] = {
        skill = "护身真气",
        type = {
            [1] = 1,
            [2] = 6,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 204,
                [2] = 10,
            },
            [2] = {
                [1] = 235,
                [2] = 10,
            },
        },
        desc = "被攻击时10%几率反弹30%伤害",
    },
    [43] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 1,
        },
        skillID = 26,
        attr = {
            [1] = {
                [1] = 247,
                [2] = 500,
            },
        },
        desc = "烈火伤害+5%",
    },
    [44] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "烈火伤害+10%，攻速+1",
    },
    [45] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "每次释放烈火剑法蓄力1层，蓄至5层时必定甩出双烈火",
    },
    [46] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "烈火伤害+15%",
    },
    [47] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "烈火剑法会引燃目标，对其造成持续的灼烧伤害，每秒灼烧敌人3%当前生命值，对怪则为每秒灼烧300血量，持续5秒",
    },
    [48] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "烈火伤害+20%，攻速+2",
    },
    [49] = {
        skill = "烈焰剑法",
        type = {
            [1] = 1,
            [2] = 7,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 247,
                [2] = 2000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "烈火对3X3范围内的敌人额外造成一次等值攻击的范围伤害",
    },
    [50] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 1,
        },
        skillID = 5,
        attr = {
            [1] = {
                [1] = 258,
                [2] = 500,
            },
        },
        desc = "火球伤害+5%",
    },
    [51] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "火球伤害+10%，人物施法速度+1",
    },
    [52] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "火球连击，30%释放大火球时同时释放两次",
    },
    [53] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "火球伤害+15%",
    },
    [54] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "火球连击，释放大火球时同时释放两次",
    },
    [55] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "火球伤害+15% 人物施法速度+2",
    },
    [56] = {
        skill = "大火球",
        type = {
            [1] = 2,
            [2] = 1,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 258,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "释放火球时有30%的概率释放灭天火，造成单体巨额伤害值并吞噬对方伤害50%的蓝量",
    },
    [57] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 1,
        },
        skillID = 8,
        desc = "对被抗拒目标造成3%生命伤害",
    },
    [58] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 2,
        },
        desc = "对被抗拒目标造成5%生命伤害",
    },
    [59] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 3,
        },
        desc = "抗拒火环推动目标距离增加1格",
    },
    [60] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 4,
        },
        desc = "对被抗拒目标造成7%生命伤害",
    },
    [61] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 5,
        },
        desc = "抗拒火环对所有目标生效（无视玩家等级）10%概率麻痹2秒",
    },
    [62] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 6,
        },
        desc = "对被抗拒目标造成10%生命伤害",
    },
    [63] = {
        skill = "抗拒火环",
        type = {
            [1] = 2,
            [2] = 2,
            [3] = 7,
        },
        desc = "被近身目标攻击时，概率自动释放火环推动敌人。",
    },
    [64] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 1,
        },
        skillID = 11,
        attr = {
            [1] = {
                [1] = 256,
                [2] = 500,
            },
        },
        desc = "雷电术伤害+5%",
    },
    [65] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "雷电术伤害+10%，施法速度+1",
    },
    [66] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "释放三次雷电术后，释放一次群体雷电术",
    },
    [67] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "群体雷电术伤害+15%",
    },
    [68] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "雷电术5%的概率将击中的目标定身1秒",
    },
    [69] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "群体雷电术伤害+20%，攻速+2",
    },
    [70] = {
        skill = "雷电术",
        type = {
            [1] = 2,
            [2] = 3,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 256,
                [2] = 1500,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "彻底领悟群体雷电术，同时释放多道雷电可以对范围5*5内的所有目标造成群体伤害",
    },
    [71] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 1,
        },
        skillID = 20,
        desc = "宝宝攻速+5%，宝宝移速+5%",
    },
    [72] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 2,
        },
        desc = "宝宝攻速+10%，宝宝移速+10%，攻速+1",
    },
    [73] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 3,
        },
        desc = "直招成3级宝宝",
    },
    [74] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 4,
        },
        desc = "使用诱惑之光诱惑怪物时100%成功",
    },
    [75] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 5,
        },
        desc = "直招成5级宝宝",
    },
    [76] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 6,
        },
        desc = "宝宝攻速+20%，宝宝移速+20%，攻速+2",
    },
    [77] = {
        skill = "诱惑之光",
        type = {
            [1] = 2,
            [2] = 4,
            [3] = 7,
        },
        desc = "直招成7级宝宝",
    },
    [78] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 1,
        },
        skillID = 22,
        attr = {
            [1] = {
                [1] = 255,
                [2] = 1000,
            },
        },
        desc = "火墙攻击目标时，伤害提升10%",
    },
    [79] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 2000,
            },
        },
        desc = "火墙攻击目标时，伤害提升20%",
    },
    [80] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 2000,
            },
        },
        desc = "火墙内目标附加绿毒效果",
    },
    [81] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 3000,
            },
        },
        desc = "火墙攻击目标时，伤害提升30%",
    },
    [82] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 3000,
            },
        },
        desc = "火墙内目标附加红毒效果",
    },
    [83] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 3000,
            },
        },
        desc = "使在火墙内的目标速度减少10%",
    },
    [84] = {
        skill = "火墙",
        type = {
            [1] = 2,
            [2] = 5,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 255,
                [2] = 3000,
            },
        },
        desc = "领悟火神之力，人物移动时，自动释放火墙",
    },
    [85] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 1,
        },
        skillID = 31,
        desc = "2级魔法盾",
    },
    [86] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 2,
        },
        desc = "3级魔法盾",
    },
    [87] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 3,
        },
        desc = "4级魔法盾",
    },
    [88] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 4,
        },
        desc = "5级魔法盾",
    },
    [89] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 5,
        },
        desc = "魔法盾覆盖一层冰霜，使攻击自己的敌人5%概率被冰冻2秒",
    },
    [90] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 6,
        },
        desc = "6级魔法盾",
    },
    [91] = {
        skill = "魔法盾",
        type = {
            [1] = 2,
            [2] = 6,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 235,
                [2] = 1500,
            },
        },
        desc = "冰冻概率提升至10%，角色HP提升15%",
    },
    [92] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 1,
        },
        skillID = 33,
        attr = {
            [1] = {
                [1] = 259,
                [2] = 500,
            },
        },
        desc = "冰咆哮伤害+5%",
    },
    [93] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "冰咆哮伤害+10%，施法速度+1",
    },
    [94] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "释放冰咆哮时有3%的概率使敌人2秒内移速降低30%，攻速降低15%(对怪无效)",
    },
    [95] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "冰咆哮伤害+15%",
    },
    [96] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "释放冰咆哮时有5%的概率对击中的所有目标释放寒冰掌，并将目标击退1格",
    },
    [97] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 2000,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "冰咆哮伤害+20%，施法速度+2",
    },
    [98] = {
        skill = "冰咆哮",
        type = {
            [1] = 2,
            [2] = 7,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 259,
                [2] = 2000,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "使用冰咆哮时有10%几率冰冻目标2秒",
    },
    [99] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 1,
        },
        skillID = 2,
        desc = "每次释放治愈术，额外恢复自身1%的最大血量",
    },
    [100] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 2,
        },
        desc = "每次释放治愈术，额外恢复自身3%的最大血量",
    },
    [101] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 3,
        },
        desc = "人物血量低于50%每5秒自动释放一次治愈术",
    },
    [102] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 4,
        },
        desc = "每次释放治愈术，额外恢复自身5%的最大血量",
    },
    [103] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 5,
        },
        desc = "治愈术进化为群体治疗术",
    },
    [104] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 6,
        },
        desc = "每次释放治愈术，额外恢复自身7%的最大血量",
    },
    [105] = {
        skill = "治愈术",
        type = {
            [1] = 3,
            [2] = 4,
            [3] = 7,
        },
        desc = "120秒内提升全体队员的20%生命上限",
    },
    [106] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 1,
        },
        skillID = 4,
        attr = {
            [1] = {
                [1] = 237,
                [2] = 300,
            },
        },
        desc = "道术+3%",
    },
    [107] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 237,
                [2] = 500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "道术+5%，施法速度+1",
    },
    [108] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 237,
                [2] = 500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "每5次攻击额外造成一次等值道术的重击伤害",
    },
    [109] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 237,
                [2] = 700,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "道术+7%",
    },
    [110] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 700,
            },
            [2] = {
                [1] = 216,
                [2] = 1,
            },
        },
        desc = "宝宝攻速+10%，宝宝移速+10%",
    },
    [111] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "道术+10%，施法速度+2",
    },
    [112] = {
        skill = "精神力战法",
        type = {
            [1] = 3,
            [2] = 2,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 236,
                [2] = 1000,
            },
            [2] = {
                [1] = 216,
                [2] = 2,
            },
        },
        desc = "宝宝攻速+20%，宝宝移速+20%",
    },
    [113] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 1,
        },
        skillID = 6,
        attr = {
            [1] = {
                [1] = 251,
                [2] = 500,
            },
        },
        desc = "施毒术伤害增加5%",
    },
    [114] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "施毒术伤害增加10%，施法速度+1",
    },
    [115] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "施毒术对目标额度造成一次道术等值的附加伤害",
    },
    [116] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "施毒术伤害增加15%",
    },
    [117] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "施毒术进化为群体施毒术",
    },
    [118] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "中毒者移速下降10%，施法速度+2",
    },
    [119] = {
        skill = "施毒术",
        type = {
            [1] = 3,
            [2] = 3,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 251,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "施放群体施毒时，10%几率触发毒素爆炸，造成道术等值的3X3的范围伤害",
    },
    [120] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 1,
        },
        skillID = 13,
        attr = {
            [1] = {
                [1] = 254,
                [2] = 500,
            },
        },
        desc = "火符伤害增加5%",
    },
    [121] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "火符伤害增加10%，施法速度+1",
    },
    [122] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 1000,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "施放灵魂火符时，几率附带幽冥火符，造成3X3群体伤害",
    },
    [123] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "火符伤害增加15%",
    },
    [124] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 1500,
            },
            [2] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "火符对目标造成伤害的同时会燃烧对方魔法值",
    },
    [125] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 2000,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "火符伤害+20%，施法速度+2",
    },
    [126] = {
        skill = "灵魂火符",
        type = {
            [1] = 3,
            [2] = 1,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 254,
                [2] = 2000,
            },
            [2] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "火符进化为裂神符，对周围反复弹射造成伤害，最多可以弹射7次",
    },
    [127] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 1,
        },
        skillID = 15,
        desc = "释放神圣战甲术时使自己周围3格内友军物理伤害减少5%，持续30秒",
    },
    [128] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 2,
        },
        desc = "释放神圣战甲术时使自己周围3格内友军魔法伤害减少5%，持续30秒",
    },
    [129] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 3,
        },
        desc = "释放神圣战甲术时使自己周围3格内友军攻击伤害增加5%，持续30秒",
    },
    [130] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 4,
        },
        desc = "释放神圣战甲术时使自己周围3格内友军物理伤害减少7%，魔法伤害减少7%，持续30秒",
    },
    [131] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 5,
        },
        desc = "向任意方向闪现5步，闪现完毕恢复自身10%血量，CD60秒",
    },
    [132] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 6,
        },
        desc = "释放神圣战甲术时使自己周围3格内友军物理伤害减少10%、魔法伤害减少10%，持续30秒",
    },
    [133] = {
        skill = "神圣战甲术",
        type = {
            [1] = 3,
            [2] = 5,
            [3] = 7,
        },
        desc = "领悟气功波，可将低于自身等级的目标狠狠弹开5格",
    },
    [134] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 1,
        },
        skillID = 18,
        desc = "隐身状态下角色移速+10%",
    },
    [135] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 2,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "施法速度+1",
    },
    [136] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 3,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "自己隐身现身后第1次伤害对目标造成1.5倍重击",
    },
    [137] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 4,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "隐身状态下角色移速+20%",
    },
    [138] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 5,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 1,
            },
        },
        desc = "隐身术进阶为群体隐身术",
    },
    [139] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 6,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "给队友或自己释放隐身术时，自己和对象的移速+25%，持续30秒，施法速度+2",
    },
    [140] = {
        skill = "隐身术",
        type = {
            [1] = 3,
            [2] = 6,
            [3] = 7,
        },
        attr = {
            [1] = {
                [1] = 217,
                [2] = 2,
            },
        },
        desc = "给队友或自己释放隐身术时，自己和对象获得攻魔道+20，持续30秒",
    },
    [141] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 1,
        },
        skillID = 76,
        desc = "宝宝召唤数+1",
    },
    [142] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 2,
        },
        desc = "宝宝召唤数+1",
    },
    [143] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 3,
        },
        desc = "解锁强化神兽，将宝宝进阶为强化神兽",
    },
    [144] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 4,
        },
        desc = "宝宝召唤数+1",
    },
    [145] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 5,
        },
        desc = "解锁金甲麒麟，将宝宝进阶为金甲麒麟",
    },
    [146] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 6,
        },
        desc = "宝宝召唤数+1",
    },
    [147] = {
        skill = "召唤神兽",
        type = {
            [1] = 3,
            [2] = 7,
            [3] = 7,
        },
        desc = "解锁月灵，将宝宝进阶为月灵",
    },
}
return config