local config = {
	[1] = {
		name = "灼烧羁绊",
		type = {
			[1] = 1,
			[2] = 1,
		},
		need = 2,
		tips = "2件：灼烧伤害增加至每秒灼烧敌人2%最大生命值，灼烧时间额外+3秒",
	},
	[2] = {
		name = "灼烧羁绊",
		type = {
			[1] = 1,
			[2] = 2,
		},
		need = 3,
		tips = "3件：灼烧伤害增加至每秒灼烧敌人3%最大生命值，灼烧时间额外+6秒",
	},
	[3] = {
		name = "灼烧羁绊",
		type = {
			[1] = 1,
			[2] = 3,
		},
		need = 5,
		tips = "5件：灼烧伤害增加至每秒灼烧敌人5%最大生命值，灼烧时间额外+10秒",
	},
	[4] = {
		name = "无限进化羁绊",
		type = {
			[1] = 2,
			[2] = 1,
		},
		need = 2,
		tips = "2件：所有叠层效率翻倍(+100%)",
	},
	[5] = {
		name = "无限进化羁绊",
		type = {
			[1] = 2,
			[2] = 2,
		},
		need = 3,
		tips = "3件：所有叠层上限x2",
	},
	[6] = {
		name = "无限进化羁绊",
		type = {
			[1] = 2,
			[2] = 3,
		},
		need = 5,
		tips = "5件：移除所有叠层上限限制，无限进化",
	},
	[7] = {
		name = "利滚利羁绊",
		type = {
			[1] = 3,
			[2] = 1,
		},
		need = 2,
		tips = "2件：本局爆率额外+10%",
	},
	[8] = {
		name = "利滚利羁绊",
		type = {
			[1] = 3,
			[2] = 2,
		},
		need = 4,
		tips = "4件：本局爆率额外+30%",
	},
	[9] = {
		name = "弹弹弹羁绊",
		type = {
			[1] = 4,
			[2] = 1,
		},
		need = 2,
		tips = "2件：火符进化为裂神符，弹射次数+2，火符伤害额外+50%",
	},
	[10] = {
		name = "弹弹弹羁绊",
		type = {
			[1] = 4,
			[2] = 2,
		},
		need = 4,
		tips = "4件：火符进化为裂神符，弹射次数+5，火符伤害额外+100%",
	},
	[11] = {
		name = "变速齿轮羁绊",
		type = {
			[1] = 5,
			[2] = 1,
		},
		need = 2,
		tips = "2件：攻速+10%，暴击伤害+10%",
	},
	[12] = {
		name = "变速齿轮羁绊",
		type = {
			[1] = 5,
			[2] = 2,
		},
		need = 4,
		tips = "4件：攻速+30%，暴击伤害+30%",
	},
	[13] = {
		name = "跑刀仔羁绊",
		type = {
			[1] = 6,
			[2] = 1,
		},
		need = 2,
		tips = "2件：隐身术进化为群体隐身术，移速+20%",
	},
	[14] = {
		name = "跑刀仔羁绊",
		type = {
			[1] = 6,
			[2] = 2,
		},
		need = 4,
		tips = "4件：获得技能净化，主动释放后解除自身所有控制和负面效果，75秒CD",
	},
	[15] = {
		name = "高贵的控制系羁绊",
		type = {
			[1] = 7,
			[2] = 1,
		},
		need = 3,
		tips = "3件：控制类技能触发概率+10%，控制时长+1秒",
	},
	[16] = {
		name = "高贵的控制系羁绊",
		type = {
			[1] = 7,
			[2] = 2,
		},
		need = 4,
		tips = "4件：控制类技能触发概率+20%，控制时长+2秒",
	},
	[17] = {
		name = "医疗小队羁绊",
		type = {
			[1] = 8,
			[2] = 1,
		},
		need = 2,
		tips = "2件：治愈术进化为群体治愈术",
	},
	[18] = {
		name = "医疗小队羁绊",
		type = {
			[1] = 8,
			[2] = 2,
		},
		need = 3,
		tips = "3件：每次释放群体治愈术，额外恢复1%的最大血量，每次释放神圣战甲术，双防额外增加5%",
	},
	[19] = {
		name = "医疗小队羁绊",
		type = {
			[1] = 8,
			[2] = 3,
		},
		need = 4,
		tips = "4件：每次释放群体治愈术，额外恢复2%的最大血量，每次释放神圣战甲术，双防额外增加10%",
	},
	[20] = {
		name = "巨人族羁绊",
		type = {
			[1] = 9,
			[2] = 1,
		},
		need = 2,
		tips = "2件：最大生命值+10%，体型增大10%，防御+10%",
	},
	[21] = {
		name = "巨人族羁绊",
		type = {
			[1] = 9,
			[2] = 2,
		},
		need = 3,
		tips = "3件：最大生命值+20%，体型增大20%，防御+20%",
	},
	[22] = {
		name = "巨人族羁绊",
		type = {
			[1] = 9,
			[2] = 3,
		},
		need = 5,
		tips = "5件：最大生命值+40%，体型增大40%，防御+40%",
	},
	[23] = {
		name = "小人国羁绊",
		type = {
			[1] = 10,
			[2] = 1,
		},
		need = 2,
		tips = "2件：对体型大于自己的角色伤害+10%，攻击附带目标最大生命值的真实伤害+1%",
	},
	[24] = {
		name = "小人国羁绊",
		type = {
			[1] = 10,
			[2] = 2,
		},
		need = 3,
		tips = "3件：对体型大于自己的角色伤害+20%，攻击附带目标最大生命值的真实伤害+2%",
	},
	[25] = {
		name = "小人国羁绊",
		type = {
			[1] = 10,
			[2] = 3,
		},
		need = 5,
		tips = "5件：对体型大于自己的角色伤害+30%，攻击附带目标最大生命值的真实伤害+3%",
	},
	[26] = {
		name = "召唤师羁绊",
		type = {
			[1] = 11,
			[2] = 1,
		},
		need = 2,
		tips = "2件：神兽进化为强化神兽，且召唤数量+1",
	},
	[27] = {
		name = "召唤师羁绊",
		type = {
			[1] = 11,
			[2] = 2,
		},
		need = 3,
		tips = "3件：强化神兽进化为金甲麒麟，且召唤数量+1",
	},
	[28] = {
		name = "召唤师羁绊",
		type = {
			[1] = 11,
			[2] = 3,
		},
		need = 4,
		tips = "4件：金甲麒麟进化为月灵，且召唤数量+2",
	},
	["89"] = {
	},
}
return config